backend/app/models/event.rb

SELECT COUNT(*) FROM "users" INNER JOIN "reservations" ON "users"."id" = "reservations"."user_id" WHERE "reservations"."event_id" = ?  [["event_id", 1]]
---
    def percent_full
        (self.capacity.to_f - self.users.count.to_f) / self.capacity.to_f * 100

SELECT COUNT(*) FROM "users" INNER JOIN "reservations" ON "users"."id" = "reservations"."user_id" WHERE "reservations"."event_id" = ?  [["event_id", 1]]
---
    def seats_remaining
        self.capacity - self.users.count