backend/app/controllers/users_controller.rb

    def create
        user = User.find_or_create_by(email: params[:email], name: params[:name])
        event = Event.find(params[:event_id])
        if user.valid?
            if event && !event.users.include?(user)
---
SELECT 1 AS one FROM "users" INNER JOIN "reservations" ON "users"."id" = "reservations"."user_id" WHERE "reservations"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 1], ["id", 26], ["LIMIT", 1]]