backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "attempt"], ["email", "t@t"], ["created_at", "2021-01-15 22:46:59.220846"], ["updated_at", "2021-01-15 22:46:59.220846"]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."name" = ? LIMIT ?  [["email", "t@t"], ["name", "attempt"], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "John"], ["email", "john@email.com"], ["created_at", "2021-01-15 00:17:09.743399"], ["updated_at", "2021-01-15 00:17:09.743399"]]
SELECT "users".* FROM "users" INNER JOIN "reservations" ON "users"."id" = "reservations"."user_id" WHERE "reservations"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "reservations" ON "users"."id" = "reservations"."user_id" WHERE "reservations"."event_id" = ?  [["event_id", 1]]
SELECT "events".* FROM "events" INNER JOIN "reservations" ON "events"."id" = "reservations"."event_id" WHERE "reservations"."user_id" = ?  [["user_id", 31]]
---
    def create
        user = User.find_or_create_by(email: params[:email], name: params[:name])
        event = Event.find(params[:event_id])


        if user.valid?
            if event
                user.events << event
                percent_full = (event.capacity.to_f - event.users.count.to_f) / event.capacity.to_f * 100
                render json: { user: user, event_id: event.id, percent_full: percent_full }
            else
                render json: user, except: [:created_at, :updated_at]
            end
        else
            errors = user.errors.full_messages.join(', ')

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "reservations" ON "users"."id" = "reservations"."user_id" WHERE "reservations"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "reservations" ON "users"."id" = "reservations"."user_id" WHERE "reservations"."event_id" = ?  [["event_id", 1]]
---
    def update
        user = User.find(params[:user_id])
        event = Event.find(params[:event_id])
        event.users.delete(user)
        percent_full = (event.capacity.to_f - event.users.count.to_f) / event.capacity.to_f * 100